account_cnt = 0
accno = []
mystocks = None


column_headers = {"my_accounts": ['종목명', '손익금액', '손익율', '매입금액', '보유수량', '평균단가', '현재가', '등락율', '거래대비', '전일대비기호'],
                  "search_stocks": ['종목명', '현재가', '등락율', '거래량', '거래대비', '유통비율'], }
column_foreground = ('손익금액', '손익율', '현재가', '등락율', '거래대비')

dic_stocks = {}  # 종목명 : code
dic_stocks_code = {}  # code : 종목명
dic_mystocks_tablewidget_index = {}
chejan_fid_dic = {'계좌번호': 9201, '주문번호': 9203, '관리자사번': 9205, '종목코드,업종코드': 9001, '주문업무분류': 912,
                  '주문상태': 913, '종목명': 302, '주문수량': 900, '주문가격': 901, '미체결수량': 902, '체결누계금액': 903,
                  '원주문번호': 904, '주문구분': 905, '매매구분': 906, '매도수구분': 907, '주문/체결시간': 908, '체결번호': 909,
                  '체결가': 910, '체결량': 911, '현재가': 10, '(최우선)매도호가': 27, '(최우선)매수호가': 28, '단위체결가': 914,
                  '단위체결량': 915, '당일매매수수료': 938}

select_accno = None  # 선택한 계좌번호

sell_rate = -1.00  # 목표 수익율
add_buy_rate = 10.00  # 추가 매수 손실율
trade_high = 9.00  # 9%이상 수익 후
trade_stop = 5.00  # 5%이하로 내려올 때 매도

buy_amt = 110000  # 종목당 매수 금액
